Комплексная_автоматизация_2_МОМ_2019/src/Documents/ПеремещениеМатериаловВПроизводстве/ПеремещениеМатериаловВПроизводстве.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеМатериаловВПроизводстве</name>
  <registerRecords>AccumulationRegister.ДвиженияСерийТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.СебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияНоменклатураДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВРеглУчете</registerRecords>
  <registerRecords>AccumulationRegister.ДетализацияПартийТоваровДляНДСиУСН</registerRecords>
  <registerRecords>AccumulationRegister.ПартииРасходовНаСебестоимостьТоваров</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ДетализацияПартийТоваровДляНДСиУСН2_4</registerRecords>
  <registerRecords>AccumulationRegister.МатериалыИРаботыВПроизводстве</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияНоменклатураНоменклатура</registerRecords>
  <registerRecords>AccumulationRegister.ПартииПроизводственныхЗатрат</registerRecords>
  <registerRecords>AccumulationRegister.ПартииЗатратНаВыпуск</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОтправитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеПолучатель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПеремещенияМатериаловВПроизводстве</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>МатериалыИРаботы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерийОтправитель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерийПолучатель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеОтправителя</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Серии</name>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеОтправителя</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Комплексная_автоматизация_2_МОМ_2019/src/InformationRegisters/АналитикаУчетаНоменклатуры/АналитикаУчетаНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АналитикаУчетаНоменклатуры</name>
  <resources>
    <name>КлючАналитики</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяКалькуляции</name>
    <type>
      <types>CatalogRef.СтатьиКалькуляции</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Комплексная_автоматизация_2_МОМ_2019/src/Enums/СтатусыПеремещенияМатериаловВПроизводстве/СтатусыПеремещенияМатериаловВПроизводстве.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПеремещенияМатериаловВПроизводстве</name>
  <enumValues>
    <name>КОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Отгружено</name>
  </enumValues>
  <enumValues>
    <name>Принято</name>
  </enumValues>
</mdclass:Enum>

Комплексная_автоматизация_2_МОМ_2019/src/Enums/ТипыЗаписейПартий/ТипыЗаписейПартий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЗаписейПартий</name>
  <enumValues>
    <name>БазаРегл</name>
  </enumValues>
  <enumValues>
    <name>БазаУпр</name>
  </enumValues>
  <enumValues>
    <name>Взносы</name>
  </enumValues>
  <enumValues>
    <name>ВключениеИсключениеНДСВСтоимости</name>
  </enumValues>
  <enumValues>
    <name>ВозвратНаДругойСклад</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПрошлыхПериодов</name>
  </enumValues>
  <enumValues>
    <name>Выпуск</name>
  </enumValues>
  <enumValues>
    <name>ВыпускБезЗаказа</name>
  </enumValues>
  <enumValues>
    <name>Дополнение</name>
  </enumValues>
  <enumValues>
    <name>ДопРасходы</name>
  </enumValues>
  <enumValues>
    <name>ДопРасходыБезПартии</name>
  </enumValues>
  <enumValues>
    <name>ДопРасходыРегл</name>
  </enumValues>
  <enumValues>
    <name>ДопРасходыСПартией</name>
  </enumValues>
  <enumValues>
    <name>ДопРасходыУпр</name>
  </enumValues>
  <enumValues>
    <name>ЗатратыБезЗаказа</name>
  </enumValues>
  <enumValues>
    <name>Импорт</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаПриобретения</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаПриобретенияПрошлогоПериода</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаСтоимости</name>
  </enumValues>
  <enumValues>
    <name>МаршрутныйЛист</name>
  </enumValues>
  <enumValues>
    <name>НЗП</name>
  </enumValues>
  <enumValues>
    <name>Остаток</name>
  </enumValues>
  <enumValues>
    <name>ОстатокБезЗаказа</name>
  </enumValues>
  <enumValues>
    <name>ОстатокДляРаспределения</name>
  </enumValues>
  <enumValues>
    <name>ОстатокНЗП</name>
  </enumValues>
  <enumValues>
    <name>ОстатокСгруппированный</name>
  </enumValues>
  <enumValues>
    <name>ОтклонениеВСтоимости</name>
  </enumValues>
  <enumValues>
    <name>ОтчетДавальцу</name>
  </enumValues>
  <enumValues>
    <name>Партия</name>
  </enumValues>
  <enumValues>
    <name>ПартияБезЗаказа</name>
  </enumValues>
  <enumValues>
    <name>ПартияСгруппированная</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеАвто</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеОбособленно</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеСгруппированное</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеУпр</name>
  </enumValues>
  <enumValues>
    <name>Переработка</name>
  </enumValues>
  <enumValues>
    <name>ПоБазеБезЗаказа</name>
  </enumValues>
  <enumValues>
    <name>ПоВсемПодразделениям</name>
  </enumValues>
  <enumValues>
    <name>ПоВсемЭтапам</name>
  </enumValues>
  <enumValues>
    <name>ПодразделенияДокумента</name>
  </enumValues>
  <enumValues>
    <name>ПодразделенияПоБазе</name>
  </enumValues>
  <enumValues>
    <name>ПолуфабрикатДавальца</name>
  </enumValues>
  <enumValues>
    <name>ПоПодразделениям</name>
  </enumValues>
  <enumValues>
    <name>Потребление</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеАвто</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ПоЭтапам</name>
  </enumValues>
  <enumValues>
    <name>ПоЭтапамПодразделений</name>
  </enumValues>
  <enumValues>
    <name>ПродукцияДавальца</name>
  </enumValues>
  <enumValues>
    <name>Прошлое</name>
  </enumValues>
  <enumValues>
    <name>Распределение</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеПоВыбывшимТоварам</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеПоПравилам</name>
  </enumValues>
  <enumValues>
    <name>Расчетное</name>
  </enumValues>
  <enumValues>
    <name>СлужебноеВключитьУправленческийУчетПоПравиламМФУ</name>
    <comment>Изменение константы ВестиУправленческийУчетОрганизаций</comment>
  </enumValues>
  <enumValues>
    <name>СлужебноеВключитьУчетПоВидамЗапасов</name>
    <comment>Включение учета себестоимости по видам запасов</comment>
  </enumValues>
  <enumValues>
    <name>СлужебноеВключитьУчетПоНазначениям</name>
    <comment>Изменение константы УчитыватьСебестоимостьТоваровПоНазначениям</comment>
  </enumValues>
  <enumValues>
    <name>СлужебноеДозаполнениеАналитикиУчетаПартийНДСиУСН2_4</name>
    <comment>Заполнение ключа аналитики учета партий для партий производства</comment>
  </enumValues>
  <enumValues>
    <name>СлужебноеИзменениеМетодаОценкиСтоимости</name>
    <comment>Изменение реквизита МетодОценкиСтоимостиТоваров в учетной политике организации</comment>
  </enumValues>
  <enumValues>
    <name>СлужебноеИзменениеПартнераВАналитикеУчетаНоменклатуры</name>
    <comment>Замена партнера на договор партнера в ключе аналитики учета номенклатуры</comment>
  </enumValues>
  <enumValues>
    <name>СлужебноеОтключитьУправленческийУчетПоПравиламМФУ</name>
    <comment>Изменение константы ВестиУправленческийУчетОрганизаций</comment>
  </enumValues>
  <enumValues>
    <name>СлужебноеОтключитьУчетПоНазначениям</name>
    <comment>Изменение константы УчитыватьСебестоимостьТоваровПоНазначениям</comment>
  </enumValues>
  <enumValues>
    <name>СлужебноеПереходНаПартионныйУчет22</name>
    <comment>Корректировки при включении партионного учета версии 2.2</comment>
  </enumValues>
  <enumValues>
    <name>СписаниеНаРасходы</name>
  </enumValues>
  <enumValues>
    <name>СписанияНаВыпуск</name>
  </enumValues>
  <enumValues>
    <name>СписанияНаВыпускПостатейные</name>
  </enumValues>
  <enumValues>
    <name>Сторно</name>
  </enumValues>
  <enumValues>
    <name>СторноВозвратНаДругойСклад</name>
  </enumValues>
  <enumValues>
    <name>СторноСписанияНаВыпуск</name>
  </enumValues>
  <enumValues>
    <name>Трудозатраты</name>
  </enumValues>
  <enumValues>
    <name>Услуги</name>
  </enumValues>
</mdclass:Enum>

Комплексная_автоматизация_2_МОМ_2019/src/Enums/ТипыЗатратРегл/ТипыЗатратРегл.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЗатратРегл</name>
  <enumValues>
    <name>МатериальныеЗатраты</name>
  </enumValues>
  <enumValues>
    <name>Работы</name>
  </enumValues>
  <enumValues>
    <name>СдельнаяОплатаТруда</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

Комплексная_автоматизация_2_МОМ_2019/src/Catalogs/Назначения/Назначения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Назначения</name>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказМатериаловВПроизводство</types>
      <types>DocumentRef.ЗаказПереработчику</types>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ЗаказНаСборку</types>
      <types>DocumentRef.ЗаказНаПеремещение</types>
      <types>DocumentRef.ЗаказНаВнутреннееПотребление</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНазначения</name>
    <type>
      <types>EnumRef.ТипыНазначений</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьТолькоНаличие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельностиНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ДвиженияПоСкладскимРегистрам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Комплексная_автоматизация_2_МОМ_2019/src/Documents/ПеремещениеМатериаловВПроизводстве/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область Серии

// Имена реквизитов, от значений которых зависят параметры указания серий.
// 
// Возвращаемое значение:
//  Строка - имена реквизитов, перечисленные через запятую.
//
Функция ИменаРеквизитовДляЗаполненияПараметровУказанияСерий() Экспорт
	
	ИменаРеквизитов = "ПодразделениеОтправитель,ПодразделениеПолучатель,Статус,Дата,ХозяйственнаяОперация";
	
	Возврат ИменаРеквизитов;
	
КонецФункции

// Возвращает параметры указания серий для товаров, указанных в документе.
//
// Параметры:
//  Объект	 - Структура - структура значений реквизитов объекта, необходимых для заполнения параметров указания серий.
// 
// Возвращаемое значение:
//  Структура - Состав полей задается в функции НоменклатураКлиентСервер.ПараметрыУказанияСерий.
//
Функция ПараметрыУказанияСерий(Объект) Экспорт
	
	ПараметрыУказанияСерий = НоменклатураКлиентСервер.ПараметрыУказанияСерий();            
	
	ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.ПеремещениеМатериаловВПроизводстве";
	
	ПараметрыУказанияСерий.ИмяТЧТовары = "МатериалыИРаботы";
	ПараметрыУказанияСерий.ИмяТЧСерии  = "Серии";
	
	ПараметрыСерийОтправитель = СкладыСервер.ИспользованиеСерийВПодразделении(Объект.ПодразделениеОтправитель);
	ПараметрыСерийПолучатель  = СкладыСервер.ИспользованиеСерийВПодразделении(Объект.ПодразделениеПолучатель);
	
	ПараметрыУказанияСерий.ИспользоватьСерииНоменклатуры = ПараметрыСерийОтправитель.ИспользоватьСерииНоменклатуры
														Или ПараметрыСерийПолучатель.ИспользоватьСерииНоменклатуры
														Или ПараметрыСерийПолучатель.УчитыватьСебестоимостьПоСериям;
	
	ПараметрыУказанияСерий.УчитыватьСебестоимостьПоСериям = ПараметрыСерийОтправитель.УчитыватьСебестоимостьПоСериям
														Или ПараметрыСерийПолучатель.УчитыватьСебестоимостьПоСериям;
														
	ПараметрыУказанияСерий.СкладскиеОперации.Добавить(Перечисления.СкладскиеОперации.ОтгрузкаПоПеремещениюВПроизводстве);
	Если Объект.Статус = Перечисления.СтатусыПеремещенияМатериаловВПроизводстве.Принято Тогда
		ПараметрыУказанияСерий.СкладскиеОперации.Добавить(Перечисления.СкладскиеОперации.ПриемкаПоПеремещениюВПроизводстве);
	КонецЕсли;
	ПараметрыУказанияСерий.СерииПриПланированииОтгрузкиУказываютсяВТЧСерии = Истина;
	ПараметрыУказанияСерий.ПоляСвязи.Добавить("Назначение");
	ПараметрыУказанияСерий.ПоляСвязи.Добавить("НазначениеОтправителя");
	
	ПараметрыУказанияСерий.ЭтоНакладная = Истина;
	
	Если Объект.Статус = Перечисления.СтатусыПеремещенияМатериаловВПроизводстве.Принято Тогда
		ПараметрыУказанияСерий.ИмяПоляСклад = "ПодразделениеПолучатель";
	Иначе	
		ПараметрыУказанияСерий.ИмяПоляСклад = "ПодразделениеОтправитель";
	КонецЕсли;
	
	ПараметрыУказанияСерий.ИмяПоляСкладОтправитель = "ПодразделениеОтправитель";
	ПараметрыУказанияСерий.ИмяПоляСкладПолучатель = "ПодразделениеПолучатель";
	
	ПараметрыУказанияСерий.ПланированиеОтгрузки = Объект.Статус = Перечисления.СтатусыПеремещенияМатериаловВПроизводстве.КОтгрузке;
	ПараметрыУказанияСерий.ПланированиеОтбора   = Объект.Статус = Перечисления.СтатусыПеремещенияМатериаловВПроизводстве.КОтгрузке;
	ПараметрыУказанияСерий.ФактОтбора           = Объект.Статус = Перечисления.СтатусыПеремещенияМатериаловВПроизводстве.Отгружено
													Или Объект.Статус = Перечисления.СтатусыПеремещенияМатериаловВПроизводстве.Принято;
													
	ПараметрыУказанияСерий.РегистрироватьСерии = НоменклатураКлиентСервер.НеобходимоРегистрироватьСерии(ПараметрыУказанияСерий);
	ПараметрыУказанияСерий.Дата = Объект.Дата;
	
	ПараметрыУказанияСерий.ИменаПолейСтатусУказанияСерий.Добавить("СтатусУказанияСерий");
	ПараметрыУказанияСерий.ИменаПолейСтатусУказанияСерий.Добавить("СтатусУказанияСерийОтправитель");
	ПараметрыУказанияСерий.ИменаПолейСтатусУказанияСерий.Добавить("СтатусУказанияСерийПолучатель");
	                
	Возврат ПараметрыУказанияСерий;
	
КонецФункции

// Возвращает текст запроса для расчета статусов указания серий
//	Параметры:
//		ПараметрыУказанияСерий - Структура - состав полей задается в функции НоменклатураКлиентСервер.ПараметрыУказанияСерий
//	Возвращаемое значение:
//		Строка - текст запроса.
//
Функция ТекстЗапросаЗаполненияСтатусовУказанияСерий(ПараметрыУказанияСерий) Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Назначение КАК Назначение,
	|	Товары.НазначениеОтправителя КАК НазначениеОтправителя,
	|	Товары.Серия КАК Серия,
	|	&СкладОтправитель КАК СкладОтправитель,
	|	&СкладПолучатель КАК СкладПолучатель,
	|	Товары.Количество КАК Количество,
	|	Товары.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	Товары.СтатусУказанияСерийОтправитель,
	|	Товары.СтатусУказанияСерийПолучатель,
	|	Товары.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	Товары.Назначение,
	|	Товары.НазначениеОтправителя,
	|	Товары.Серия,
	|	Товары.СкладОтправитель,
	|	Товары.СкладПолучатель,
	|	ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура).ВидНоменклатуры КАК ВидНоменклатуры,
	|	СУММА(Товары.Количество) КАК Количество
	|ПОМЕСТИТЬ ТоварыДляЗапроса
	|ИЗ
	|	Товары КАК Товары
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	Товары.Назначение,
	|	Товары.НазначениеОтправителя,
	|	Товары.Серия,
	|	Товары.СкладОтправитель,
	|	Товары.СкладПолучатель,
	|	ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура).ВидНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Серии.Номенклатура,
	|	Серии.Характеристика,
	|	Серии.Назначение,
	|	Серии.НазначениеОтправителя,
	|	Серии.Количество
	|ПОМЕСТИТЬ Серии
	|ИЗ
	|	&Серии КАК Серии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Серии.Номенклатура,
	|	Серии.Характеристика,
	|	Серии.Назначение,
	|	Серии.НазначениеОтправителя,
	|	СУММА(Серии.Количество) КАК Количество
	|ПОМЕСТИТЬ СерииДляЗапроса
	|ИЗ
	|	Серии КАК Серии
	|
	|СГРУППИРОВАТЬ ПО
	|	Серии.Номенклатура,
	|	Серии.Характеристика,
	|	Серии.Назначение,
	|	Серии.НазначениеОтправителя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.СтатусУказанияСерий КАК СтатусУказанияСерийСтарый,
	|	ВЫБОР
	|		КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий ЕСТЬ NULL 
	|			ТОГДА 0
	|		КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УчитыватьСебестоимостьПоСериям
	|			ТОГДА ВЫБОР
	|					КОГДА Товары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|						ТОГДА 14
	|					ИНАЧЕ 13
	|				КОНЕЦ
	|		КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УчитыватьОстаткиСерий
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(СерииДляЗапроса.Количество, 0) = 0 И НЕ &ФактОтбора
	|						ТОГДА 11
	|					КОГДА ТоварыДляЗапроса.Количество = ЕСТЬNULL(СерииДляЗапроса.Количество, 0)
	|							И ТоварыДляЗапроса.Количество > 0
	|						ТОГДА 10
	|					ИНАЧЕ 9
	|				КОНЕЦ
	|		КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УчетСерийПоFEFO
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(СерииДляЗапроса.Количество, 0) = 0 И НЕ &ФактОтбора
	|						ТОГДА 11
	|					КОГДА ТоварыДляЗапроса.Количество = ЕСТЬNULL(СерииДляЗапроса.Количество, 0)
	|							И ТоварыДляЗапроса.Количество > 0
	|						ТОГДА 6
	|					ИНАЧЕ 5
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтатусУказанияСерий
	|ПОМЕСТИТЬ СтатусыОтправитель
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыДляЗапроса КАК ТоварыДляЗапроса
	|			ЛЕВОЕ СОЕДИНЕНИЕ СерииДляЗапроса КАК СерииДляЗапроса
	|			ПО ТоварыДляЗапроса.Номенклатура = СерииДляЗапроса.Номенклатура
	|				И ТоварыДляЗапроса.Характеристика = СерииДляЗапроса.Характеристика
	|				И ТоварыДляЗапроса.Назначение = СерииДляЗапроса.Назначение
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры.ПолитикиУчетаСерий КАК ПолитикиУчетаСерий
	|			ПО (ПолитикиУчетаСерий.Склад = ТоварыДляЗапроса.СкладОтправитель)
	|				И ТоварыДляЗапроса.ВидНоменклатуры = ПолитикиУчетаСерий.Ссылка
	|		ПО Товары.Номенклатура = ТоварыДляЗапроса.Номенклатура
	|			И Товары.Характеристика = ТоварыДляЗапроса.Характеристика
	|			И Товары.Назначение = ТоварыДляЗапроса.Назначение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.СтатусУказанияСерий КАК СтатусУказанияСерийСтарый,
	|	ВЫБОР
	|		КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий ЕСТЬ NULL 
	|			ТОГДА 0
	|		КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УчитыватьСебестоимостьПоСериям
	|			ТОГДА ВЫБОР
	|					КОГДА Товары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|						ТОГДА 14
	|					ИНАЧЕ 13
	|				КОНЕЦ
	|		КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УчитыватьОстаткиСерий
	|			ТОГДА ВЫБОР
	|					КОГДА ТоварыДляЗапроса.Количество = ЕСТЬNULL(СерииДляЗапроса.Количество, 0)
	|								И ТоварыДляЗапроса.Количество > 0
	|							ИЛИ Товары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|						ТОГДА 10
	|					ИНАЧЕ 9
	|				КОНЕЦ
	|		КОГДА &ПриемкаПоПеремещениюВПроизводстве
	|				И ПолитикиУчетаСерий.ПолитикаУчетаСерий.УказыватьПриПолученииМатериалов
	|			ТОГДА ВЫБОР
	|					КОГДА ТоварыДляЗапроса.Количество = ЕСТЬNULL(СерииДляЗапроса.Количество, 0)
	|								И ТоварыДляЗапроса.Количество > 0
	|							ИЛИ Товары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|						ТОГДА ВЫБОР
	|								КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УчитыватьОстаткиСерий
	|									ТОГДА 4
	|								ИНАЧЕ 2
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ПолитикиУчетаСерий.ПолитикаУчетаСерий.УчитыватьОстаткиСерий
	|								ТОГДА 3
	|							ИНАЧЕ 1
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтатусУказанияСерий
	|ПОМЕСТИТЬ СтатусыПолучатель
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыДляЗапроса КАК ТоварыДляЗапроса
	|			ЛЕВОЕ СОЕДИНЕНИЕ СерииДляЗапроса КАК СерииДляЗапроса
	|			ПО ТоварыДляЗапроса.Номенклатура = СерииДляЗапроса.Номенклатура
	|				И ТоварыДляЗапроса.Характеристика = СерииДляЗапроса.Характеристика
	|				И ТоварыДляЗапроса.Назначение = СерииДляЗапроса.Назначение
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры.ПолитикиУчетаСерий КАК ПолитикиУчетаСерий
	|			ПО (ПолитикиУчетаСерий.Склад = ТоварыДляЗапроса.СкладПолучатель)
	|				И (ПолитикиУчетаСерий.Ссылка = ТоварыДляЗапроса.ВидНоменклатуры)
	|		ПО Товары.Номенклатура = ТоварыДляЗапроса.Номенклатура
	|			И Товары.Характеристика = ТоварыДляЗапроса.Характеристика
	|			И Товары.Назначение = ТоварыДляЗапроса.Назначение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	СтатусыОтправитель.СтатусУказанияСерий КАК СтатусУказанияСерийОтправитель,
	|	ВЫБОР
	|		КОГДА &ПриемкаПоПеремещениюВПроизводстве
	|			ТОГДА СтатусыПолучатель.СтатусУказанияСерий
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтатусУказанияСерийПолучатель,
	|	ВЫБОР
	|		КОГДА СтатусыПолучатель.СтатусУказанияСерий В (13, 14)
	|				И СтатусыОтправитель.СтатусУказанияСерий <> 0
	|			ТОГДА СтатусыПолучатель.СтатусУказанияСерий
	|		КОГДА СтатусыОтправитель.СтатусУказанияСерий В (5, 6)
	|			ТОГДА СтатусыОтправитель.СтатусУказанияСерий
	|		КОГДА СтатусыОтправитель.СтатусУказанияСерий > ВЫБОР
	|				КОГДА &ПриемкаПоПеремещениюВПроизводстве
	|					ТОГДА СтатусыПолучатель.СтатусУказанияСерий
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|			ТОГДА СтатусыОтправитель.СтатусУказанияСерий
	|		ИНАЧЕ СтатусыПолучатель.СтатусУказанияСерий
	|	КОНЕЦ КАК СтатусУказанияСерий
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтатусыОтправитель КАК СтатусыОтправитель
	|		ПО (СтатусыОтправитель.НомерСтроки = Товары.НомерСтроки)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтатусыПолучатель КАК СтатусыПолучатель
	|		ПО (СтатусыПолучатель.НомерСтроки = Товары.НомерСтроки)
	|ГДЕ
	|	(СтатусыОтправитель.СтатусУказанияСерий <> Товары.СтатусУказанияСерийОтправитель
	|			ИЛИ ВЫБОР
	|				КОГДА &ПриемкаПоПеремещениюВПроизводстве
	|					ТОГДА СтатусыПолучатель.СтатусУказанияСерий
	|				ИНАЧЕ 0
	|			КОНЕЦ <> Товары.СтатусУказанияСерийПолучатель
	|			ИЛИ ВЫБОР
	|				КОГДА СтатусыПолучатель.СтатусУказанияСерий В (13, 14)
	|						И СтатусыОтправитель.СтатусУказанияСерий <> 0
	|					ТОГДА СтатусыПолучатель.СтатусУказанияСерий
	|				КОГДА СтатусыОтправитель.СтатусУказанияСерий В (5, 6)
	|					ТОГДА СтатусыОтправитель.СтатусУказанияСерий
	|				КОГДА СтатусыОтправитель.СтатусУказанияСерий > ВЫБОР
	|						КОГДА &ПриемкаПоПеремещениюВПроизводстве
	|							ТОГДА СтатусыПолучатель.СтатусУказанияСерий
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|					ТОГДА СтатусыОтправитель.СтатусУказанияСерий
	|				ИНАЧЕ СтатусыПолучатель.СтатусУказанияСерий
	|			КОНЕЦ <> Товары.СтатусУказанияСерий)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Товары.НомерСтроки";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область Статус

// Формирует запрос проверки при смене статуса списка документов
//
// Параметры:
// 		МассивДокументов - Массив - Массив ссылок на документы, которые надо проверять
// 		НовыйСтатус - Строка - Имя нового статуса
// 		ДополнительныеПараметры - Структура - Структура дополнительных параметров.
//
// Возвращаемое значение:
// 		Запрос - Запрос проверки перед сменой статуса.
//
Функция СформироватьЗапросПроверкиПриСменеСтатуса(МассивДокументов, НовыйСтатус, ДополнительныеПараметры) Экспорт
	
	ЗначениеНовогоСтатуса = Перечисления.СтатусыПеремещенияМатериаловВПроизводстве[НовыйСтатус];
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаДокументов.Ссылка                КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаДокументов.Ссылка) КАК Представление,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаДокументов.Статус) КАК ПредставлениеТекущегоСтатуса,
	|	ПРЕДСТАВЛЕНИЕ(&Статус)                  КАК ПредставлениеНовогоСтатуса,
	|	ВЫБОР
	|		КОГДА ТаблицаДокументов.Статус = &Статус ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ                                   КАК СтатусСовпадает,
	|	ТаблицаДокументов.Проведен              КАК Проведен,
	|	ТаблицаДокументов.ПометкаУдаления       КАК ПометкаУдаления,
	|	ИСТИНА                                  КАК ЗаписьПроведением
	|ИЗ
	|	Документ.ПеремещениеМатериаловВПроизводстве КАК ТаблицаДокументов
	|ГДЕ
	|	ТаблицаДокументов.Ссылка В(&МассивДокументов)";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Статус", ЗначениеНовогоСтатуса);
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	
	Возврат Запрос;
	
КонецФункции

// Возвращает результат проверки при смене статуса документа
//
// Параметры:
// 		ВыборкаПроверки - ВыборкаИзРезультатаЗапроса - Текущая строка выборки
// 		НовыйСтатус - Перечисление - Новый статус
// 		ДополнительныеПараметры - Структура - Структура дополнительных параметров.
//
// Возвращаемое значение:
// 		Булево - Истина, в случае успешного завершения проверки.
//
Функция ПроверкаПередСменойСтатуса(ВыборкаПроверки, НовыйСтатус, ДополнительныеПараметры) Экспорт
	
	Возврат Истина; // Для документа отсутствуют дополнительные проверки
	
КонецФункции

#КонецОбласти

#Область Прочее

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	
	
КонецПроцедуры

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	
	
КонецПроцедуры

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// Инициализирует параметры, обслуживающие выбор назначений в формах документа.
// 
//  Возвращаемое значение:
//  Структура - структура параметров, см. Справочники.Назначения.МакетФормыВыбораНазначений().
//
Функция МакетФормыВыбораНазначений() Экспорт
	
	МакетФормы = Справочники.Назначения.МакетФормыВыбораНазначений();
	
	ОписаниеКолонок = Справочники.Назначения.ДобавитьОписаниеКолонок(МакетФормы, "ВсеНазначения", Истина, "Объект.МатериалыИРаботы.Назначение");
	
	
	Возврат МакетФормы;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт

	ИсточникиДанных = Новый Соответствие;

	Возврат ИсточникиДанных; 

КонецФункции

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	// Создание запроса инициализации движений и заполенение его параметров.
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	// Формирование текста запроса.
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапросаТаблицаПартииПроизводственныхЗатрат(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаМатериалыИРаботыВПроизводстве(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаДвиженияСерийТоваров(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаСебестоимостьТоваров(Запрос, ТекстыЗапроса, Регистры);
	
	// Исполнение запроса и выгрузка полученных таблиц для движений.
	ПроведениеСерверУТ.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                      КАК Ссылка,
	|	ДанныеДокумента.Дата                        КАК Дата,
	|	ДанныеДокумента.Дата                        КАК Период,
	|	ДанныеДокумента.Статус                      КАК Статус,
	|	ДанныеДокумента.Организация                 КАК Организация,
	|	ДанныеДокумента.ПодразделениеОтправитель    КАК ПодразделениеОтправитель,
	|	ДанныеДокумента.ПодразделениеПолучатель     КАК ПодразделениеПолучатель
	|ИЗ
	|	Документ.ПеремещениеМатериаловВПроизводстве КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Запрос.УстановитьПараметр("Период",                   Реквизиты.Дата);
	Запрос.УстановитьПараметр("Статус",                   Реквизиты.Статус);
	Запрос.УстановитьПараметр("Организация",              Реквизиты.Организация);
	Запрос.УстановитьПараметр("ПодразделениеОтправитель", Реквизиты.ПодразделениеОтправитель);
	Запрос.УстановитьПараметр("ПодразделениеПолучатель",  Реквизиты.ПодразделениеПолучатель);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ЗаполнитьПараметрыИнициализации(Запрос, Реквизиты);
	
КонецПроцедуры

Процедура ИнициализироватьКлючиАналитикиНоменклатуры(Запрос)

	Если Запрос = Неопределено ИЛИ Запрос.Параметры.Свойство("КлючиАналитикиНоменклатурыИнициализированы") Тогда
		Возврат;
	КонецЕсли;
	
	ЗапросАналитики = Новый Запрос("
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таб.Склад,
	|	Таб.Номенклатура,
	|	Таб.Характеристика,
	|	Таб.Назначение,
	|	Таб.Серия
	|ИЗ (
	// Аналитика учета номенклатуры подразделения - отправителя
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		&ПодразделениеОтправитель КАК Склад,
	|		ТаблицаМатериалыИРаботы.Номенклатура КАК Номенклатура,
	|		ТаблицаМатериалыИРаботы.Характеристика КАК Характеристика,
	|		ТаблицаМатериалыИРаботы.Назначение КАК Назначение,
	|		(ВЫБОР
	|			КОГДА ТаблицаМатериалыИРаботы.СтатусУказанияСерийОтправитель = 14
	|				ТОГДА ТаблицаМатериалыИРаботы.Серия
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КОНЕЦ) КАК Серия
	|ИЗ
	|		Документ.ПеремещениеМатериаловВПроизводстве.МатериалыИРаботы КАК ТаблицаМатериалыИРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
	|		ПО (Аналитика.Номенклатура = ТаблицаМатериалыИРаботы.Номенклатура)
	|			И (Аналитика.Характеристика = ТаблицаМатериалыИРаботы.Характеристика)
	|			И (Аналитика.Назначение = ТаблицаМатериалыИРаботы.НазначениеОтправителя)
	|			И (Аналитика.МестоХранения = &ПодразделениеОтправитель)
	|			И ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка) = Аналитика.СтатьяКалькуляции
	|			И (ВЫБОР
	|				КОГДА ТаблицаМатериалыИРаботы.СтатусУказанияСерийОтправитель = 14
	|					ТОГДА ТаблицаМатериалыИРаботы.Серия = Аналитика.Серия
	|				ИНАЧЕ Аналитика.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КОНЕЦ)
	|	ГДЕ
	|		ТаблицаМатериалыИРаботы.Ссылка = &Ссылка
	|		И Аналитика.Номенклатура ЕСТЬ NULL 
	|
	// Аналитика учета номенклатуры подразделения - отправителя без назначения
	|	ОБЪЕДИНИТЬ ВСЕ
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		&ПодразделениеОтправитель КАК Склад,
	|		ТаблицаМатериалыИРаботы.Номенклатура КАК Номенклатура,
	|		ТаблицаМатериалыИРаботы.Характеристика КАК Характеристика,
	|		ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|		(ВЫБОР
	|			КОГДА ТаблицаМатериалыИРаботы.СтатусУказанияСерийОтправитель = 14
	|				ТОГДА ТаблицаМатериалыИРаботы.Серия
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КОНЕЦ) КАК Серия
	|ИЗ
	|		Документ.ПеремещениеМатериаловВПроизводстве.МатериалыИРаботы КАК ТаблицаМатериалыИРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
	|		ПО (Аналитика.Номенклатура = ТаблицаМатериалыИРаботы.Номенклатура)
	|			И (Аналитика.Характеристика = ТаблицаМатериалыИРаботы.Характеристика)
	|			И (Аналитика.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка))
	|			И (Аналитика.МестоХранения = &ПодразделениеОтправитель)
	|			И ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка) = Аналитика.СтатьяКалькуляции
	|			И (ВЫБОР
	|				КОГДА ТаблицаМатериалыИРаботы.СтатусУказанияСерийОтправитель = 14
	|					ТОГДА ТаблицаМатериалыИРаботы.Серия = Аналитика.Серия
	|				ИНАЧЕ Аналитика.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КОНЕЦ)
	|	ГДЕ
	|		ТаблицаМатериалыИРаботы.Ссылка = &Ссылка
	|		И Аналитика.Номенклатура ЕСТЬ NULL 
	|		И НЕ &УчитыватьСебестоимостьТоваровПоНазначениям
	|
	// Аналитика учета номенклатуры подразделения - получателя
	|	ОБЪЕДИНИТЬ ВСЕ
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		&ПодразделениеПолучатель,
	|		ТаблицаМатериалыИРаботы.Номенклатура,
	|		ТаблицаМатериалыИРаботы.Характеристика,
	|		ТаблицаМатериалыИРаботы.Назначение,
	|		(ВЫБОР
	|			КОГДА ТаблицаМатериалыИРаботы.СтатусУказанияСерийПолучатель = 14
	|				ТОГДА ТаблицаМатериалыИРаботы.Серия
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КОНЕЦ) КАК Серия
	|	ИЗ
	|		Документ.ПеремещениеМатериаловВПроизводстве.МатериалыИРаботы КАК ТаблицаМатериалыИРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
	|		ПО (Аналитика.Номенклатура = ТаблицаМатериалыИРаботы.Номенклатура)
	|			И (Аналитика.Характеристика = ТаблицаМатериалыИРаботы.Характеристика)
	|			И (Аналитика.Назначение = ТаблицаМатериалыИРаботы.Назначение)
	|			И (Аналитика.МестоХранения = &ПодразделениеПолучатель)
	|			И ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка) = Аналитика.СтатьяКалькуляции
	|			И (ВЫБОР
	|				КОГДА ТаблицаМатериалыИРаботы.СтатусУказанияСерийПолучатель = 14
	|					ТОГДА ТаблицаМатериалыИРаботы.Серия = Аналитика.Серия
	|				ИНАЧЕ ТаблицаМатериалыИРаботы.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КОНЕЦ)
	|	ГДЕ
	|		ТаблицаМатериалыИРаботы.Ссылка = &Ссылка
	|		И Аналитика.Номенклатура ЕСТЬ NULL
	|
	// Аналитика учета номенклатуры подразделения - получателя без назначения
	|	ОБЪЕДИНИТЬ ВСЕ
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		&ПодразделениеПолучатель,
	|		ТаблицаМатериалыИРаботы.Номенклатура,
	|		ТаблицаМатериалыИРаботы.Характеристика,
	|		ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|		(ВЫБОР
	|			КОГДА ТаблицаМатериалыИРаботы.СтатусУказанияСерийПолучатель = 14
	|				ТОГДА ТаблицаМатериалыИРаботы.Серия
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КОНЕЦ) КАК Серия
	|	ИЗ
	|		Документ.ПеремещениеМатериаловВПроизводстве.МатериалыИРаботы КАК ТаблицаМатериалыИРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
	|		ПО (Аналитика.Номенклатура = ТаблицаМатериалыИРаботы.Номенклатура)
	|			И (Аналитика.Характеристика = ТаблицаМатериалыИРаботы.Характеристика)
	|			И (Аналитика.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка))
	|			И (Аналитика.МестоХранения = &ПодразделениеПолучатель)
	|			И ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка) = Аналитика.СтатьяКалькуляции
	|			И (ВЫБОР
	|				КОГДА ТаблицаМатериалыИРаботы.СтатусУказанияСерийПолучатель = 14
	|					ТОГДА ТаблицаМатериалыИРаботы.Серия = Аналитика.Серия
	|				ИНАЧЕ ТаблицаМатериалыИРаботы.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КОНЕЦ)
	|	ГДЕ
	|		ТаблицаМатериалыИРаботы.Ссылка = &Ссылка
	|		И Аналитика.Номенклатура ЕСТЬ NULL) КАК Таб");
	
	ЗапросАналитики.УстановитьПараметр("Ссылка", Запрос.Параметры.Ссылка);
	ЗапросАналитики.УстановитьПараметр("ПодразделениеОтправитель", Запрос.Параметры.ПодразделениеОтправитель);
	ЗапросАналитики.УстановитьПараметр("ПодразделениеПолучатель", Запрос.Параметры.ПодразделениеПолучатель);
	ЗапросАналитики.УстановитьПараметр("УчитыватьСебестоимостьТоваровПоНазначениям",
		Запрос.Параметры.УчитыватьСебестоимостьТоваровПоНазначениям);
	
	Выборка = ЗапросАналитики.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		РегистрыСведений.АналитикаУчетаНоменклатуры.СоздатьКлючАналитики(Выборка);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("КлючиАналитикиНоменклатурыИнициализированы", Истина);
	
КонецПроцедуры

Функция ТекстЗапросаВтТаблицаСерииТоваровОтправитель(Запрос, ТекстыЗапроса)

	ИмяРегистра = "ВтТаблицаСерииТоваровОтправитель";
	
	ИнициализироватьКлючиАналитикиНоменклатуры(Запрос);
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура                                   КАК Номенклатура,
	|	ТаблицаТовары.Характеристика                                 КАК Характеристика,
	|	АналитикаОтправителя.КлючАналитики                           КАК АналитикаУчетаНоменклатурыОтправитель,
	|	АналитикаОтправителяБезНазначения.КлючАналитики              КАК АналитикаУчетаНоменклатурыОтправительБезНазначения,
	|	АналитикаПолучателя.КлючАналитики                            КАК АналитикаУчетаНоменклатурыПолучатель,
	|	АналитикаПолучателяБезНазначения.КлючАналитики               КАК АналитикаУчетаНоменклатурыПолучательБезНазначения,
	|	ТаблицаТовары.Назначение                                     КАК Назначение,
	|	ТаблицаТовары.Количество                                     КАК Количество,
	|	ТаблицаТовары.СтатусУказанияСерийОтправитель                 КАК СтатусУказанияСерий,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.СтатусУказанияСерийОтправитель В (4, 6, 8, 10, 14)
	|			ТОГДА ТаблицаТовары.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ                                                        КАК Серия,
	|	ТаблицаТовары.НомерСтроки,
	|	0 КАК Порядок
	|ПОМЕСТИТЬ ВтТаблицаСерииТоваровОтправитель
	|ИЗ
	|	Документ.ПеремещениеМатериаловВПроизводстве.МатериалыИРаботы КАК ТаблицаТовары
	// Аналитика учета номенклатуры подразделения - отправителя
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаОтправителя
	|	ПО (АналитикаОтправителя.Номенклатура = ТаблицаТовары.Номенклатура)
	|		И (АналитикаОтправителя.Характеристика = ТаблицаТовары.Характеристика)
	|		И (АналитикаОтправителя.Назначение = ТаблицаТовары.НазначениеОтправителя)
	|		И (АналитикаОтправителя.МестоХранения = &ПодразделениеОтправитель)
	|		И ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка) = АналитикаОтправителя.СтатьяКалькуляции
	|		И (ВЫБОР
	|			КОГДА ТаблицаТовары.СтатусУказанияСерийОтправитель = 14
	|				ТОГДА ТаблицаТовары.Серия = АналитикаОтправителя.Серия
	|			ИНАЧЕ АналитикаОтправителя.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КОНЕЦ)
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаОтправителяБезНазначения
	|	ПО (АналитикаОтправителяБезНазначения.Номенклатура = ТаблицаТовары.Номенклатура)
	|		И (АналитикаОтправителяБезНазначения.Характеристика = ТаблицаТовары.Характеристика)
	|		И (АналитикаОтправителяБезНазначения.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка))
	|		И (АналитикаОтправителяБезНазначения.МестоХранения = &ПодразделениеОтправитель)
	|		И ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка) = АналитикаОтправителяБезНазначения.СтатьяКалькуляции
	|		И (ВЫБОР
	|			КОГДА ТаблицаТовары.СтатусУказанияСерийОтправитель = 14
	|				ТОГДА ТаблицаТовары.Серия = АналитикаОтправителяБезНазначения.Серия
	|			ИНАЧЕ АналитикаОтправителяБезНазначения.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КОНЕЦ)
	// Аналитика учета номенклатуры подразделения - получателя
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаПолучателя
	|	ПО (АналитикаПолучателя.Номенклатура = ТаблицаТовары.Номенклатура)
	|		И (АналитикаПолучателя.Характеристика = ТаблицаТовары.Характеристика)
	|		И (АналитикаПолучателя.Назначение = ТаблицаТовары.Назначение)
	|		И (АналитикаПолучателя.МестоХранения = &ПодразделениеПолучатель)
	|		И ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка) = АналитикаПолучателя.СтатьяКалькуляции
	|		И (ВЫБОР
	|			КОГДА ТаблицаТовары.СтатусУказанияСерийПолучатель = 14
	|				ТОГДА ТаблицаТовары.Серия = АналитикаПолучателя.Серия
	|			ИНАЧЕ АналитикаПолучателя.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КОНЕЦ)
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаПолучателяБезНазначения
	|	ПО (АналитикаПолучателяБезНазначения.Номенклатура = ТаблицаТовары.Номенклатура)
	|		И (АналитикаПолучателяБезНазначения.Характеристика = ТаблицаТовары.Характеристика)
	|		И (АналитикаПолучателяБезНазначения.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка))
	|		И (АналитикаПолучателяБезНазначения.МестоХранения = &ПодразделениеПолучатель)
	|		И ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка) = АналитикаПолучателяБезНазначения.СтатьяКалькуляции
	|		И (ВЫБОР
	|			КОГДА ТаблицаТовары.СтатусУказанияСерийПолучатель = 14
	|				ТОГДА ТаблицаТовары.Серия = АналитикаПолучателяБезНазначения.Серия
	|			ИНАЧЕ АналитикаПолучателяБезНазначения.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КОНЕЦ)
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И ТаблицаТовары.Количество <> 0
	|	И (НЕ ТаблицаТовары.СтатусУказанияСерийОтправитель В (4, 6, 8, 10)
	|			ИЛИ ТаблицаТовары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаСерии.Номенклатура,
	|	ТаблицаСерии.Характеристика,
	|	АналитикаОтправителя.КлючАналитики                           КАК АналитикаУчетаНоменклатурыОтправитель,
	|	АналитикаОтправителяБезНазначения.КлючАналитики              КАК АналитикаУчетаНоменклатурыОтправительБезНазначения,
	|	АналитикаПолучателя.КлючАналитики                            КАК АналитикаУчетаНоменклатурыПолучатель,
	|	АналитикаПолучателяБезНазначения.КлючАналитики               КАК АналитикаУчетаНоменклатурыПолучательБезНазначения,
	|	ТаблицаСерии.Назначение,
	|	ТаблицаСерии.Количество,
	|	МАКСИМУМ(ТаблицаТовары.СтатусУказанияСерийОтправитель),
	|	ТаблицаСерии.Серия,
	|	МИНИМУМ(ТаблицаСерии.НомерСтроки),
	|	1
	|ИЗ
	|	Документ.ПеремещениеМатериаловВПроизводстве.Серии КАК ТаблицаСерии
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеремещениеМатериаловВПроизводстве.МатериалыИРаботы КАК ТаблицаТовары
	|	ПО ТаблицаСерии.Ссылка = ТаблицаТовары.Ссылка
	|		И ТаблицаСерии.Номенклатура = ТаблицаТовары.Номенклатура
	|		И ТаблицаСерии.Характеристика = ТаблицаТовары.Характеристика
	|		И ТаблицаСерии.Назначение = ТаблицаТовары.Назначение
	// Аналитика учета номенклатуры подразделения - отправителя
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаОтправителя
	|	ПО (АналитикаОтправителя.Номенклатура = ТаблицаТовары.Номенклатура)
	|		И (АналитикаОтправителя.Характеристика = ТаблицаТовары.Характеристика)
	|		И (АналитикаОтправителя.Назначение = ТаблицаТовары.НазначениеОтправителя)
	|		И ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка) = АналитикаОтправителя.СтатьяКалькуляции
	|		И (АналитикаОтправителя.МестоХранения = &ПодразделениеОтправитель)
	|		И (ВЫБОР
	|			КОГДА ТаблицаТовары.СтатусУказанияСерийОтправитель = 14
	|				ТОГДА ТаблицаТовары.Серия = АналитикаОтправителя.Серия
	|			ИНАЧЕ АналитикаОтправителя.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КОНЕЦ)
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаОтправителяБезНазначения
	|	ПО (АналитикаОтправителяБезНазначения.Номенклатура = ТаблицаТовары.Номенклатура)
	|		И (АналитикаОтправителяБезНазначения.Характеристика = ТаблицаТовары.Характеристика)
	|		И (АналитикаОтправителяБезНазначения.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка))
	|		И ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка) = АналитикаОтправителяБезНазначения.СтатьяКалькуляции
	|		И (АналитикаОтправителяБезНазначения.МестоХранения = &ПодразделениеОтправитель)
	|		И (ВЫБОР
	|			КОГДА ТаблицаТовары.СтатусУказанияСерийОтправитель = 14
	|				ТОГДА ТаблицаТовары.Серия = АналитикаОтправителяБезНазначения.Серия
	|			ИНАЧЕ АналитикаОтправителяБезНазначения.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КОНЕЦ)
	// Аналитика учета номенклатуры подразделения - получателя
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаПолучателя
	|	ПО (АналитикаПолучателя.Номенклатура = ТаблицаТовары.Номенклатура)
	|		И (АналитикаПолучателя.Характеристика = ТаблицаТовары.Характеристика)
	|		И (АналитикаПолучателя.Назначение = ТаблицаТовары.Назначение)
	|		И ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка) = АналитикаПолучателя.СтатьяКалькуляции
	|		И (АналитикаПолучателя.МестоХранения = &ПодразделениеПолучатель)
	|		И (ВЫБОР
	|			КОГДА ТаблицаТовары.СтатусУказанияСерийПолучатель = 14
	|				ТОГДА ТаблицаТовары.Серия = АналитикаПолучателя.Серия
	|			ИНАЧЕ АналитикаПолучателя.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КОНЕЦ)
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаПолучателяБезНазначения
	|	ПО (АналитикаПолучателяБезНазначения.Номенклатура = ТаблицаТовары.Номенклатура)
	|		И (АналитикаПолучателяБезНазначения.Характеристика = ТаблицаТовары.Характеристика)
	|		И (АналитикаПолучателяБезНазначения.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка))
	|		И ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка) = АналитикаПолучателяБезНазначения.СтатьяКалькуляции
	|		И (АналитикаПолучателяБезНазначения.МестоХранения = &ПодразделениеПолучатель)
	|		И (ВЫБОР
	|			КОГДА ТаблицаТовары.СтатусУказанияСерийПолучатель = 14
	|				ТОГДА ТаблицаТовары.Серия = АналитикаПолучателяБезНазначения.Серия
	|			ИНАЧЕ АналитикаПолучателяБезНазначения.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КОНЕЦ)
	|ГДЕ
	|	ТаблицаСерии.Ссылка = &Ссылка
	|	И ТаблицаТовары.Ссылка = &Ссылка
	|	И ТаблицаСерии.Количество <> 0
	|	И ТаблицаТовары.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаСерии.Номенклатура,
	|	ТаблицаСерии.Характеристика,
	|	АналитикаОтправителя.КлючАналитики,
	|	АналитикаОтправителяБезНазначения.КлючАналитики,
	|	АналитикаПолучателя.КлючАналитики,
	|	АналитикаПолучателяБезНазначения.КлючАналитики,
	|	ТаблицаСерии.Назначение,
	|	ТаблицаСерии.Серия,
	|	ТаблицаСерии.Количество
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(ТаблицаТовары.СтатусУказанияСерийОтправитель) В (4, 6, 8, 10)";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаВтТаблицаСерииТоваровПолучатель(Запрос, ТекстыЗапроса)

	ИмяРегистра = "ВтТаблицаСерииТоваровПолучатель";
	
	ИнициализироватьКлючиАналитикиНоменклатуры(Запрос);
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	АналитикаПолучателя.КлючАналитики КАК АналитикаУчетаНоменклатурыПолучатель,
	|	АналитикаПолучателяБезНазначения.КлючАналитики КАК АналитикаУчетаНоменклатурыПолучательБезНазначения,
	|	ТаблицаТовары.Назначение КАК Назначение,
	|	ТаблицаТовары.Количество КАК Количество,
	|	ТаблицаТовары.СтатусУказанияСерийПолучатель КАК СтатусУказанияСерий,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.СтатусУказанияСерийПолучатель В (4, 6, 8, 10, 14)
	|			ТОГДА ТаблицаТовары.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Серия
	|ПОМЕСТИТЬ ВтТаблицаСерииТоваровПолучатель
	|ИЗ
	|	Документ.ПеремещениеМатериаловВПроизводстве.МатериалыИРаботы КАК ТаблицаТовары
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаПолучателя
	|	ПО (АналитикаПолучателя.Номенклатура = ТаблицаТовары.Номенклатура)
	|		И (АналитикаПолучателя.Характеристика = ТаблицаТовары.Характеристика)
	|		И ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка) = АналитикаПолучателя.СтатьяКалькуляции
	|		И (АналитикаПолучателя.Назначение = ТаблицаТовары.Назначение)
	|		И (АналитикаПолучателя.МестоХранения = &ПодразделениеПолучатель)
	|		И (ВЫБОР
	|			КОГДА ТаблицаТовары.СтатусУказанияСерийПолучатель = 14
	|			ТОГДА ТаблицаТовары.Серия = АналитикаПолучателя.Серия
	|			ИНАЧЕ АналитикаПолучателя.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КОНЕЦ)
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаПолучателяБезНазначения
	|	ПО (АналитикаПолучателяБезНазначения.Номенклатура = ТаблицаТовары.Номенклатура)
	|		И (АналитикаПолучателяБезНазначения.Характеристика = ТаблицаТовары.Характеристика)
	|		И ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка) = АналитикаПолучателяБезНазначения.СтатьяКалькуляции
	|		И (АналитикаПолучателяБезНазначения.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка))
	|		И (АналитикаПолучателяБезНазначения.МестоХранения = &ПодразделениеПолучатель)
	|		И (ВЫБОР
	|			КОГДА ТаблицаТовары.СтатусУказанияСерийПолучатель = 14
	|				ТОГДА ТаблицаТовары.Серия = АналитикаПолучателяБезНазначения.Серия
	|			ИНАЧЕ АналитикаПолучателяБезНазначения.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КОНЕЦ)
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И ТаблицаТовары.Количество <> 0
	|	И (НЕ ТаблицаТовары.СтатусУказанияСерийПолучатель В (4, 6, 8, 10)
	|			ИЛИ ТаблицаТовары.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МИНИМУМ(ТаблицаТовары.НомерСтроки),
	|	ТаблицаСерии.Номенклатура,
	|	ТаблицаСерии.Характеристика,
	|	АналитикаПолучателя.КлючАналитики КАК АналитикаУчетаНоменклатурыПолучатель,
	|	АналитикаПолучателяБезНазначения.КлючАналитики КАК АналитикаУчетаНоменклатурыПолучательБезНазначения,
	|	ТаблицаСерии.Назначение,
	|	ТаблицаСерии.Количество,
	|	МАКСИМУМ(ТаблицаТовары.СтатусУказанияСерийПолучатель),
	|	ТаблицаСерии.Серия
	|ИЗ
	|	Документ.ПеремещениеМатериаловВПроизводстве.Серии КАК ТаблицаСерии
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеремещениеМатериаловВПроизводстве.МатериалыИРаботы КАК ТаблицаТовары
	|	ПО ТаблицаСерии.Ссылка = ТаблицаТовары.Ссылка
	|		И ТаблицаСерии.Номенклатура = ТаблицаТовары.Номенклатура
	|		И ТаблицаСерии.Характеристика = ТаблицаТовары.Характеристика
	|		И ТаблицаСерии.Назначение = ТаблицаТовары.Назначение
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаПолучателя
	|	ПО (АналитикаПолучателя.Номенклатура = ТаблицаТовары.Номенклатура)
	|		И (АналитикаПолучателя.Характеристика = ТаблицаТовары.Характеристика)
	|		И ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка) = АналитикаПолучателя.СтатьяКалькуляции
	|		И (АналитикаПолучателя.Назначение = ТаблицаТовары.Назначение)
	|		И (АналитикаПолучателя.МестоХранения = &ПодразделениеПолучатель)
	|		И (ВЫБОР
	|			КОГДА ТаблицаТовары.СтатусУказанияСерийПолучатель = 14
	|				ТОГДА ТаблицаТовары.Серия = АналитикаПолучателя.Серия
	|			ИНАЧЕ АналитикаПолучателя.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КОНЕЦ)
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаПолучателяБезНазначения
	|	ПО (АналитикаПолучателяБезНазначения.Номенклатура = ТаблицаТовары.Номенклатура)
	|		И (АналитикаПолучателяБезНазначения.Характеристика = ТаблицаТовары.Характеристика)
	|		И ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка) = АналитикаПолучателяБезНазначения.СтатьяКалькуляции
	|		И (АналитикаПолучателяБезНазначения.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка))
	|		И (АналитикаПолучателяБезНазначения.МестоХранения = &ПодразделениеПолучатель)
	|		И (ВЫБОР
	|			КОГДА ТаблицаТовары.СтатусУказанияСерийПолучатель = 14
	|				ТОГДА ТаблицаТовары.Серия = АналитикаПолучателяБезНазначения.Серия
	|			ИНАЧЕ АналитикаПолучателяБезНазначения.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КОНЕЦ)
	|ГДЕ
	|	ТаблицаСерии.Ссылка = &Ссылка
	|	И ТаблицаТовары.Ссылка = &Ссылка
	|	И ТаблицаСерии.Количество <> 0
	|	И ТаблицаТовары.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаСерии.Номенклатура,
	|	АналитикаПолучателя.КлючАналитики,
	|	АналитикаПолучателяБезНазначения.КлючАналитики,
	|	ТаблицаСерии.Характеристика,
	|	ТаблицаСерии.Назначение,
	|	ТаблицаСерии.Серия,
	|	ТаблицаСерии.Количество
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(ТаблицаТовары.СтатусУказанияСерийПолучатель) В (4, 6, 8, 10)";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаВтПеремещения(Запрос, ТекстыЗапроса)

	ИмяРегистра = "ВТПеремещения";
	
	ИнициализироватьКлючиАналитикиНоменклатуры(Запрос);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаМатериалыИРаботы.НомерСтроки КАК НомерСтроки,
	|	АналитикаОтправителя.КлючАналитики КАК АналитикаУчетаНоменклатурыОтправитель,
	|	АналитикаПолучателя.КлючАналитики КАК АналитикаУчетаНоменклатурыПолучатель,
	|	ТаблицаМатериалыИРаботы.Количество КАК Количество
	|ПОМЕСТИТЬ ВТПеремещения
	|ИЗ
	|	Документ.ПеремещениеМатериаловВПроизводстве.МатериалыИРаботы КАК ТаблицаМатериалыИРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаОтправителя
	|		ПО (АналитикаОтправителя.Номенклатура = ТаблицаМатериалыИРаботы.Номенклатура)
	|			И (АналитикаОтправителя.Характеристика = ТаблицаМатериалыИРаботы.Характеристика)
	|			И (АналитикаОтправителя.Назначение = ТаблицаМатериалыИРаботы.НазначениеОтправителя)
	|			И ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка) = АналитикаОтправителя.СтатьяКалькуляции
	|			И (АналитикаОтправителя.МестоХранения = &ПодразделениеОтправитель)
	|			И ВЫБОР
	|				КОГДА ТаблицаМатериалыИРаботы.СтатусУказанияСерийОтправитель = 14
	|				ТОГДА ТаблицаМатериалыИРаботы.Серия = АналитикаОтправителя.Серия
	|				ИНАЧЕ АналитикаОтправителя.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|			   КОНЕЦ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаПолучателя
	|		ПО (АналитикаПолучателя.Номенклатура = ТаблицаМатериалыИРаботы.Номенклатура)
	|			И (АналитикаПолучателя.Характеристика = ТаблицаМатериалыИРаботы.Характеристика)
	|			И (АналитикаПолучателя.Назначение = ТаблицаМатериалыИРаботы.Назначение)
	|			И ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка) = АналитикаПолучателя.СтатьяКалькуляции
	|			И (АналитикаПолучателя.МестоХранения = &ПодразделениеПолучатель)
	|			И ВЫБОР
	|				КОГДА ТаблицаМатериалыИРаботы.СтатусУказанияСерийПолучатель = 14
	|				ТОГДА ТаблицаМатериалыИРаботы.Серия = АналитикаПолучателя.Серия
	|				ИНАЧЕ АналитикаПолучателя.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|			   КОНЕЦ
	|ГДЕ
	|	ТаблицаМатериалыИРаботы.Ссылка = &Ссылка";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаТаблицаМатериалыИРаботыВПроизводстве(Запрос, ТекстыЗапроса, Регистры)

	ИмяРегистра = "МатериалыИРаботыВПроизводстве";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если НЕ ПроведениеСерверУТ.ЕстьТаблицаЗапроса("ВтТаблицаСерииТоваровОтправитель", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаСерииТоваровОтправитель(Запрос, ТекстыЗапроса);
	КонецЕсли; 
	Если НЕ ПроведениеСерверУТ.ЕстьТаблицаЗапроса("ВтТаблицаСерииТоваровПолучатель", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаСерииТоваровПолучатель(Запрос, ТекстыЗапроса);
	КонецЕсли; 
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаМатериалыИРаботы.НомерСтроки КАК НомерСтроки,
	|	&Период КАК Период,
	|	&Период КАК ДатаРегистратора,
	|	&Организация КАК Организация,
	|	&ПодразделениеОтправитель КАК Подразделение,
	|	ТаблицаМатериалыИРаботы.Номенклатура,
	|	ТаблицаМатериалыИРаботы.Характеристика,
	|	ТаблицаМатериалыИРаботы.Серия,
	|	ТаблицаМатериалыИРаботы.АналитикаУчетаНоменклатурыОтправитель КАК АналитикаУчетаНоменклатуры,
	|	ТаблицаМатериалыИРаботы.Количество КАК Количество,
	|	&ПодразделениеПолучатель КАК ПодразделениеПолучатель,
	|	ТаблицаМатериалыИРаботы.Назначение КАК Назначение
	|ИЗ
	|	ВтТаблицаСерииТоваровОтправитель КАК ТаблицаМатериалыИРаботы
	|ГДЕ
	|	&Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыПеремещенияМатериаловВПроизводстве.Отгружено),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыПеремещенияМатериаловВПроизводстве.Принято))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаМатериалыИРаботы.НомерСтроки,
	|	&Период,
	|	&Период,
	|	&Организация,
	|	&ПодразделениеПолучатель КАК Подразделение,
	|	ТаблицаМатериалыИРаботы.Номенклатура,
	|	ТаблицаМатериалыИРаботы.Характеристика,
	|	ТаблицаМатериалыИРаботы.Серия,
	|	ТаблицаМатериалыИРаботы.АналитикаУчетаНоменклатурыПолучатель,
	|	ТаблицаМатериалыИРаботы.Количество,
	|	НЕОПРЕДЕЛЕНО,
	|	ТаблицаМатериалыИРаботы.Назначение КАК Назначение
	|ИЗ
	|	ВтТаблицаСерииТоваровПолучатель КАК ТаблицаМатериалыИРаботы
	|ГДЕ
	|	&Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПеремещенияМатериаловВПроизводстве.Принято)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаТаблицаПартииПроизводственныхЗатрат(Запрос, ТекстыЗапроса, Регистры)

	ИмяРегистра = "ПартииПроизводственныхЗатрат";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если НЕ ПроведениеСерверУТ.ЕстьТаблицаЗапроса("ВТПеремещения", ТекстыЗапроса) Тогда
		ТекстЗапросаВТПеремещения(Запрос, ТекстыЗапроса);
	КонецЕсли; 
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	Таб.НомерСтроки КАК НомерСтроки,
	|	&Период КАК Период,
	|	&Организация КАК Организация,
	|	Таб.АналитикаУчетаНоменклатурыПолучатель КАК АналитикаУчетаНоменклатуры,
	|	&Ссылка КАК ДокументПоступления,
	|	Таб.Количество КАК Количество
	|ИЗ
	|	ВТПеремещения КАК Таб
	|ГДЕ
	|	НЕ &ПартионныйУчетВерсии22
	|
	|УПОРЯДОЧИТЬ ПО
	|	Таб.НомерСтроки";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаТаблицаДвиженияСерийТоваров(Запрос, ТекстыЗапроса, Регистры)

	ИмяРегистра = "ДвиженияСерийТоваров";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаСерии.Номенклатура КАК Номенклатура,
	|	ТаблицаСерии.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ТаблицаСерии.НазначениеОтправителя <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаСерии.НазначениеОтправителя.ДвиженияПоСкладскимРегистрам
	|						ТОГДА ТаблицаСерии.НазначениеОтправителя
	|				КОНЕЦ
	|	КОНЕЦ КАК Назначение,
	|	ТаблицаСерии.Серия КАК Серия,
	|	ТаблицаСерии.Количество КАК Количество,
	|	&ПодразделениеОтправитель КАК Отправитель,
	|	&ПодразделениеПолучатель КАК Получатель,
	|	ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ОтгрузкаПоПеремещениюВПроизводстве) КАК СкладскаяОперация,
	|	&Ссылка КАК Документ,
	|	&Период КАК Период,
	|	ИСТИНА КАК ЭтоСкладскоеДвижение
	|ИЗ
	|	Документ.ПеремещениеМатериаловВПроизводстве.Серии КАК ТаблицаСерии
	|ГДЕ
	|	ТаблицаСерии.Ссылка = &Ссылка
	|	И ТаблицаСерии.Количество <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаСерии.Номенклатура КАК Номенклатура,
	|	ТаблицаСерии.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ТаблицаСерии.НазначениеОтправителя <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаСерии.НазначениеОтправителя.ДвиженияПоСкладскимРегистрам
	|						ТОГДА ТаблицаСерии.НазначениеОтправителя
	|				КОНЕЦ
	|	КОНЕЦ КАК Назначение,
	|	ТаблицаСерии.Серия КАК Серия,
	|	ТаблицаСерии.Количество КАК Количество,
	|	&ПодразделениеОтправитель КАК Отправитель,
	|	&ПодразделениеПолучатель КАК Получатель,
	|	ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ОтгрузкаПоПеремещениюВПроизводстве) КАК СкладскаяОперация,
	|	&Ссылка КАК Документ,
	|	&Период КАК Период,
	|	ИСТИНА КАК ЭтоСкладскоеДвижение
	|ИЗ
	|	Документ.ПеремещениеМатериаловВПроизводстве.МатериалыИРаботы КАК ТаблицаСерии
	|ГДЕ
	|	ТаблицаСерии.Ссылка = &Ссылка
	|	И ТаблицаСерии.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаТаблицаСебестоимостьТоваров(Запрос, ТекстыЗапроса, Регистры) Экспорт

	ИмяРегистра = "СебестоимостьТоваров";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если НЕ ПроведениеСерверУТ.ЕстьТаблицаЗапроса("ВтТаблицаСерииТоваровОтправитель", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаСерииТоваровОтправитель(Запрос, ТекстыЗапроса);
	КонецЕсли; 
	Если НЕ ПроведениеСерверУТ.ЕстьТаблицаЗапроса("ВтТаблицаСерииТоваровПолучатель", ТекстыЗапроса) Тогда
		ТекстЗапросаВтТаблицаСерииТоваровПолучатель(Запрос, ТекстыЗапроса);
	КонецЕсли; 
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	1 КАК Порядок,
	|	ТаблицаМатериалыИРаботы.НомерСтроки КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	(ВЫБОР
	|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям
	|			ТОГДА ТаблицаМатериалыИРаботы.АналитикаУчетаНоменклатурыОтправитель
	|		ИНАЧЕ ТаблицаМатериалыИРаботы.АналитикаУчетаНоменклатурыОтправительБезНазначения КОНЕЦ) КАК АналитикаУчетаНоменклатуры,
	|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)	КАК РазделУчета,
	|	&Организация КАК Организация,
	|	ТаблицаМатериалыИРаботы.Количество КАК Количество,
	|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)	КАК КорРазделУчета,
	|	(ВЫБОР
	|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям
	|			ТОГДА ТаблицаМатериалыИРаботы.АналитикаУчетаНоменклатурыПолучатель
	|		ИНАЧЕ ТаблицаМатериалыИРаботы.АналитикаУчетаНоменклатурыПолучательБезНазначения КОНЕЦ) КАК КорАналитикаУчетаНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ВидДеятельностиНДС,
	|	ЕСТЬNULL(ТаблицаМатериалыИРаботы.Назначение.ВидДеятельностиНДС,ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)) КАК КорВидДеятельностиНДС,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеТоваров) КАК ХозяйственнаяОперация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ПотреблениеПроизводство) КАК ТипЗаписи
	|ИЗ
	|	ВтТаблицаСерииТоваровОтправитель КАК ТаблицаМатериалыИРаботы
	|ГДЕ
	|	&ПартионныйУчетВерсии22
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ТаблицаМатериалыИРаботы.НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период КАК Период,
	|	(ВЫБОР
	|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям
	|			ТОГДА ТаблицаМатериалыИРаботы.АналитикаУчетаНоменклатурыПолучатель
	|		ИНАЧЕ ТаблицаМатериалыИРаботы.АналитикаУчетаНоменклатурыПолучательБезНазначения КОНЕЦ) КАК АналитикаУчетаНоменклатуры,
	|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)	КАК РазделУчета,
	|	&Организация КАК Организация,
	|	ТаблицаМатериалыИРаботы.Количество КАК Количество,
	|	НЕОПРЕДЕЛЕНО КАК КорРазделУчета,
	|	НЕОПРЕДЕЛЕНО КАК КорАналитикаУчетаНоменклатуры,
	|	ЕСТЬNULL(ТаблицаМатериалыИРаботы.Назначение.ВидДеятельностиНДС,ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)) КАК ВидДеятельностиНДС,
	|	НЕОПРЕДЕЛЕНО КАК КорВидДеятельностиНДС,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеТоваров) КАК ХозяйственнаяОперация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Перемещение) КАК ТипЗаписи
	|ИЗ
	|	ВтТаблицаСерииТоваровПолучатель КАК ТаблицаМатериалыИРаботы
	|ГДЕ
	|	&ПартионныйУчетВерсии22
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти

#Область ПроведениеПоРеглУчету

// Функция возвращает текст запроса для отражения документа в регламентированном учете.
//
// Возвращаемое значение:
//	Строка - Текст запроса
//
Функция ТекстОтраженияВРеглУчете() Экспорт
		
	// (Дт 20, 23 :: Кт 20, 23)
	ТекстПеремещениеМатериалов = "
	|ВЫБРАТЬ //// Перемещение материалов в производстве (Дт 20, 23 :: Кт 20, 23)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	ЕСТЬNULL(Стоимости.Сумма, Строки.Сумма) КАК Сумма,
	|	ЕСТЬNULL(Стоимости.СуммаУУ, Строки.СуммаУУ) КАК СуммаУУ,
	|
	|	ВЫБОР КОГДА Строки.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Производство)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы)
	|	КОНЕЦ КАК ВидСчетаДт,
	|	ВЫБОР КОГДА Строки.СтатьяРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|		ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ Строки.СтатьяРасходов
	|	КОНЕЦ КАК АналитикаУчетаДт,
	|	Операция.ПодразделениеПолучатель КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Операция.ПодразделениеПолучатель КАК ПодразделениеДт,
	|	ЕСТЬNULL(Стоимости.КорНаправлениеДеятельности, Строки.КорНаправлениеДеятельности) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	Строки.Номенклатура КАК СубконтоДт1,
	|	Строки.ГруппаПродукции КАК СубконтоДт2,
	|	ВЫБОР 
	|		КОГДА Строки.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Работы)
	|		ИНАЧЕ 
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.МатериальныеЗатраты) 
	|	КОНЕЦ КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	Строки.Количество КАК КоличествоДт,
	|	ЕСТЬNULL(Стоимости.СуммаНУ, Строки.СуммаНУ) КАК СуммаНУДт,
	|	ЕСТЬNULL(Стоимости.СуммаПР, Строки.СуммаПР) КАК СуммаПРДт,
	|	ЕСТЬNULL(Стоимости.СуммаВР, Строки.СуммаВР) КАК СуммаВРДт,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Производство) КАК ВидСчетаКт,
	|
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	Операция.ПодразделениеОтправитель КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	Операция.ПодразделениеОтправитель КАК ПодразделениеКт,
	|	ЕСТЬNULL(Стоимости.НаправлениеДеятельности, Строки.НаправлениеДеятельности) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	Строки.Номенклатура КАК СубконтоКт1,
	|	Строки.ГруппаПродукции КАК СубконтоКт2,
	|	ВЫБОР 
	|		КОГДА Строки.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Работы)
	|		ИНАЧЕ 
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.МатериальныеЗатраты) 
	|	КОНЕЦ КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	Строки.Количество КАК КоличествоКт,
	|	ЕСТЬNULL(Стоимости.СуммаНУ, Строки.СуммаНУ) КАК СуммаНУКт,
	|	ЕСТЬNULL(Стоимости.СуммаПР, Строки.СуммаПР) КАК СуммаПРКт,
	|	ЕСТЬNULL(Стоимости.СуммаВР, Строки.СуммаВР) КАК СуммаВРКт,
	|	""Перемещение материалов в производстве"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПеремещениеМатериаловВПроизводстве КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ВтСтроки КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|		И Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ВтСтоимости КАК Стоимости
	|	ПО
	|		Строки.Ссылка = Стоимости.Ссылка
	|		И Строки.Номенклатура = Стоимости.Номенклатура
	|		И Строки.Склад = Стоимости.Склад
	|		И Строки.ГруппаФинансовогоУчета = Стоимости.ГруппаФинансовогоУчета
	|		И Строки.НаправлениеДеятельности = Стоимости.НаправлениеДеятельности
	|		И Строки.ТипЗапасов = Стоимости.ТипЗапасов
	|		И Строки.Контрагент = Стоимости.Контрагент
	|		И Строки.СтатьяРасходов = Стоимости.СтатьяРасходов
	|		И Строки.ГруппаПродукции = Стоимости.ГруппаПродукции
	|";
	
	Возврат ТекстПеремещениеМатериалов;
	
КонецФункции

// Функция возвращает текст запроса дополнительных временных таблиц, 
// необходимых для отражения в регламентированном учете.
//
Функция ТекстЗапросаВТОтраженияВРеглУчете() Экспорт
	
	Возврат "";
	
КонецФункции

#КонецОбласти

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
